Repository: zipf/perldoc-es
Catalog: memory/clean/omegat_clean_prj-level2.tmx
Source language: en_us
Languages: es

source: Void context just means the value has been discarded, such as a statement containing only C<"fred";> or C<getpwuid(0);>.
es: El contexto vacío significa simplemente que se ha descartado el valor, como por ejemplo en una instrucción que consista únicamente en una cadena (p. ej., C<"alfredo";>) o una llamada a función (p. ej., C<getpwuid(0);>).

source: We saw this earlier in the C<print_info()> example, which calls C<< $self->path >>.
es: Ya vimos esto antes en el ejemplo C<imprimir_info()>, que llama a C<< $self->ruta >>.

source: We already talked about the special C<@ISA> array and the L<parent> pragma.
es: Ya hemos hablado sobre el array especial C<@ISA> y el pragma L<parent>.

source: We also covered L<Mouse> briefly.
es: También se ha descrito brevemente L<Mouse>.

source: We also recommend using this method to check whether a module has a sufficient version.
es: También le recomendamos que use este método para comprobar si un módulo tiene la versión necesaria.

source: We are not blessing the reference itself, nor the variable that contains that reference.
es: No se bendicen ni la referencia en sí ni tampoco la variable que contiene la referencia.

source: We can also pass additional arguments to the method:
es: También pueden pasarse argumentos adicionales al método:

source: We can also use a variable to store a reference to the data structure that is being blessed as our object:
es: También podemos usar una variable para almacenar una referencia a la estructura de datos que se bendice como objeto:

source: We can create a module C<customre> to do this:
es: Podemos crear para ello un módulo C<rxpersonal>:

source: We can deal with this by using both an assertion and a negation.
es: Podemos abordar este problema con una aserción y una negación.

source: We can manipulate C<@_> in other ways too:
es: También podemos manipular C<@_> de otras maneras:

source: We can override a parent's method in a child class.
es: En una clase derivada se puede sobrescribir un método de la clase primaria.

source: We could create a parent class called C<HasOnOffSwitch>, but that is very artificial.
es: Podríamos crear una clase primaria llamada C<TieneInterruptor>, pero sería algo muy artificial.

source: We could go even further, and make the C<path> and C<content> accessors return objects as well.
es: Incluso se puede hacer que los métodos de acceso a C<ruta> y C<contenido> devuelvan también objetos.

source: We could have both classes inherit from a common parent, like C<Machine>, but not all machines have on/off switches.
es: Podríamos hacer que ambas clases heredasen de una clase primaria común, como C<Máquina>, aunque no todas las máquinas disponen de estos interruptores.

source: We could name our constructor something else:
es: Podríamos haber llamado al constructor de cualquier otra forma:

source: We encourage you to try C<Moose> out first before worrying about startup speed.
es: Le animamos a probar C<Moose> antes de preocuparse por la velocidad de inicio.

source: We encourage you to learn more by reading the C<Moose> documentation, starting with L<Moose::Manual|http://search.cpan.org/perldoc?Moose::Manual>.
es: Le animamos a aprender más mediante la lectura de la documentación de C<Moose>, comenzando con L<Moose::Manual|http://search.cpan.org/perldoc?Moose::Manual>.

source: We encourage you to play with and evaluate L<Moose>, L<Class::Accessor>, and L<Object::Tiny> to see which OO system is right for you.
es: Le recomendamos que pruebe L<Moose>, L<Class::Accessor> y L<Object::Tiny> para decidir qué sistema de orientación a objetos le conviene más.

source: We had passed around various names (baton, token, hot potato) but none caught on.
es: Habíamos probado varios nombres (testigo, símbolo, patata caliente), pero ninguno despertaba entusiasmo.

source: We mentioned earlier that most Perl objects are implemented as hashes under the hood.
es: Ya se ha mencionado previamente que la mayoría de los objetos Perl se implementan internamente como hashes.

source: We mentioned multiple inheritance earlier.
es: Antes mencionamos la herencia múltiple.

source: We mostly just
es: solo

source: We must also provide some more regression tests to make sure our patch works and doesn't create a bug somewhere else along the line.
es: También tenemos que proporcionar pruebas de regresión adicionales para asegurarnos de que nuestro parche funciona y no crea ningún error en otro lugar.

source: We no longer install the Perl 5 to-do list as a manpage, as installing snapshot that becomes increasingly out of date isn't that useful to anyone.
es: Ya no instalamos la lista de tareas pendientes de Perl 5 como una página de manual; la instantánea instalada quedaba obsoleta al poco tiempo, por lo que no era de mucha utilidad.

source: We now compile up Perl, and run it through the test suite.
es: Ahora compilamos Perl y ejecutamos la serie de pruebas.

source: We often refer to inheritance relationships as B<parent-child> or C<superclass/subclass> relationships.
es: A menudo se alude a las relaciones de herencia como relaciones B<primario-derivado> o C<superclase/subclase>.

source: We recommend that you don't do this unless you know exactly what you're doing.
es: Recomendamos no hacer esto, a no ser que sepa exactamente qué está haciendo.

source: We recommend that you avoid this syntax, for several reasons.
es: Se recomienda evitar el uso de esta sintaxis por varias razones.

source: We recommend that you only access attributes via B<accessor> methods.
es: Le recomendamos que solo acceda a los atributos a través de los métodos de B<acceso>.

source: We recommend that you use this Moose-like syntax if you choose C<Class::Accessor> since it means you will have a smoother upgrade path if you later decide to move to C<Moose>.
es: Le recomendamos el uso del estilo de sintaxis de Moose si elige C<Class::Accessor>, ya que así le resultará más sencillo el trabajo de migración si posteriormente decide usar C<Moose>.

source: We recommend that you use this method to access another package's version, rather than looking directly at C<$Package::VERSION>.
es: Le recomendamos que use este método para acceder a la versión de otro paquete, en lugar de mirar directamente en C<$Paquete::VERSION>.

source: We sometimes say that an object has been "blessed into a class".
es: A veces se dice que un objeto ha sido "bendecido en una clase".

source: We strongly recommend that you use one of these systems.
es: Le recomendamos que use alguno de los sistemas siguientes.

source: We tend to avoid this term because it means so many things.
es: Normalmente evitamos usar este término porque tiene muchos significados posibles.

source: We usually "call" subroutines but "invoke" methods, since it sounds cooler.
es: Normalmente "llamamos" a las subrutinas, pero a los métodos los "invocamos" porque suena mejor.

source: We want to model that in our class definitions.
es: Queremos expresar esto en las definiciones de las clases.

source: We will cover this in more detail later.
es: Se describirá en detalle más adelante.

source: We'll have another string pointer in there:
es: Tendremos ahí otro puntero de cadena:

source: We'll say that the first part in $1 must be followed both by a digit and by something that's not "123".
es: Decimos que la primera parte en $1 debe ir seguida de un dígito y de algo que no es "123".

source: We're going to primarily concentrate on Perl-only modules here, rather than XS modules.
es: Vamos a centrarnos principalmente en módulos de Perl puro, no en módulos XS.

source: We've already seen how to print to standard output using C<print()>.
es: Ya hemos visto la manera de imprimir en la salida estándar mediante C<print()>.

source: Welcome to the joys of maintaining a software project...
es: Así probará las mieles del mantenimiento de un proyecto de software...

source: Well, apart from a bare C<binmode $fh>, you shouldn't treat them specially.
es: Bueno, aparte de usar C<binmode $fh>, no debe darles ningún tratamiento especial

source: Well, if we have a pointer to the start of C<pat> then, if we see a C<U> we can test whether we're still at the start of the string.
es: Si tenemos un puntero al comienzo de C<pat> y vemos una C<U>, podemos comprobar si aún estamos en el principio de la cadena.

source: Well, if you can, upgrade to the most recent, but certainly C<5.8.1> or newer.
es: Si puede, actualice a la versión más reciente; debe usar como mínimo la versión C<5.8.1>.

source: Well, the arguments to a subroutine are available to us as a special array called C<@_> (see L<perlvar> for more on that).
es: Los argumentos pasados a una subrutina están disponibles en un array especial denominado C<@_> (consulte L<perlvar> para obtener más información).

source: What Perl does is look at the object's class first (C in this case).
es: Perl busca en primer lugar en la clase del objeto (C en este caso).

source: What You See Is What You Get.
es: I<What You See Is What You Get>.

source: What a L</process> does when it has to wait for something: "My process blocked waiting for the disk." As an unrelated noun, it refers to a large chunk of data, of a size that the L</operating system> likes to deal with (normally a power of two such as 512 or 8192).
es: Lo que un L</proceso> hace mientras espera algo: "Mi proceso se bloqueó esperando la respuesta del disco.". La segunda acepción hace referencia a un fragmento de datos grande, del tamaño que al L</sistema operativo> le gusta procesar (normalmente una potencia de dos, como 512 o 8192).

source: What is CPAN?
es: ¿Qué es CPAN?

source: What is CPAN?>).
es: ¿Qué es CPAN?>).

source: What makes a method special is I<how it's called>.
es: Lo que hace especiales a los métodos es I<la forma de llamarlos>.

source: What makes a method special is that it expects to receive either an object or a class name as its first argument.
es: Lo que hace que un método sea especial es que espera recibir o un objeto o un nombre de clase como primer argumento.

source: What makes all of this important is that the Exporter module uses glob aliasing as the import/export mechanism.
es: Lo que hace que todo esto sea importante es que el módulo Exporter usa alias de expansión como mecanismo de importación/exportación.

source: What some helper L</process> did to transform the incoming data into a form more suitable for the current process.
es: Lo que hace algún L</proceso> auxiliar para transformar los datos entrantes a un formato más adecuada para el proceso actual.

source: What you are told when someone thinks you should Read The Fine Manual.
es: Read The Fine Manual, lo que le dirán cuando piensen que lo que tiene que hacer es leer el magnífico manual disponible.

source: What you get from your ancestors, genetically or otherwise.
es: Lo que se obtiene de los antepasados, ya sea por vía genética o de otro modo.

source: What you get when you do C<Perl++> twice.
es: Lo que se obtiene al ejecutar C<Perl++> dos veces.

source: What's happening is that you've asked "Is it true that at the start of $x, following 0 or more non-digits, you have something that's not 123?" If the pattern matcher had let C<\D*> expand to "ABC", this would have caused the whole pattern to fail.
es: Lo que pasa es que hemos preguntado "¿Es verdad que, al principio de $x, después de 0 o más caracteres que no son dígitos, hay algo que no es 123?". Si el detector de patrones hubiese dejado que C<\D*> se expandiera a "ABC", se habría producido un error de coincidencia de todo el patrón.

source: What's that C<shift>?
es: ¿Qué hace C<shift>?

source: Whatever a reference refers to, which may or may not have a name.
es: Aquello a lo que una referencia hace referencia; puede tener nombre o no.

source: Whatever value your C<AUTOLOAD> method returns is returned to the caller.
es: Sea cual sea el valor devuelto por el método C<AUTOLOAD>, se devuelve al código que hace la llamada.

source: When a numeric value is passed as an argument to such an operator, it will be converted to the format understood by the operator.
es: Cuando se pasa un valor numérico como argumento a un operador así, se convierte a un formato comprensible para el operador.

source: When you write to the database you will have to use something like this:
es: Para escribir en la base de datos debe usar una instrucción similar a la siguiente:

source: When C<S> can match, it is a better match than when only C<T> can match.
es: Cuando C<S> puede coincidir, es una coincidencia mejor que cuando solo puede coincidir C<T>.

source: When Democritus gave the word "atom" to the indivisible bits of matter, he meant literally something that could not be cut: I<a-> (not) + I<tomos> (cuttable).
es: Cuando Demócrito llamó "átomo" a las partes indivisibles de la materia, quería decir literalmente algo que no se puede dividir: I<a->(no) + I<tomos> (divisible).

source: When Perl 5 was first released (see L<perlhist>), several modules were included, which have now fallen out of common use.
es: Cuando se lanzó Perl 5 (vea L<perlhist>) se incluyeron varios módulos que ya no se usan habitualmente.

source: When Perl is configured to use ithreads, it will use re-entrant library calls in preference to non-re-entrant versions.
es: Si Perl está configurado para usar ithreads, las llamadas a biblioteca reentrantes tendrán preferencia sobre las versiones no reentrantes.

source: When Perl searches for a method, it caches the lookup so that future calls to the method do not need to search for it again.
es: Cuando Perl busca un método, almacena en caché la búsqueda, a fin de que llamadas posteriores a ese método no tengan que repetir la búsqueda.

source: When a thread is cloned all Perl data is cloned, however non-Perl data cannot be cloned automatically.
es: Cuando se clona un hilo de ejecución, se clonan también todos los datos de Perl. Sin embargo, los datos que no pertenecen a Perl no se pueden clonar automáticamente.

source: When a class has multiple parents, the method lookup order becomes more complicated.
es: Cuando una clase tiene múltiples clases primarias, el orden de búsqueda de métodos se complica.

source: When a class inherits from another class, any methods defined in the parent class are available to the child class.
es: Cuando una clase hereda de otra, cualquier método definido en la clase primaria también estará disponible en la clase derivada.

source: When a match has failed, and unless another verb has been involved in failing the match and has provided its own name to use, the C<$REGERROR> variable will be set to the name of the most recently executed C<(*MARK:NAME)>.
es: Cuando se produce un error de coincidencia, y a menos que haya participado otro verbo en dicho error de coincidencia y haya proporcionado su propio nombre, se establecerá como valor de la variable C<$REGERROR> el nombre del último patrón C<(*MARK:NOMBRE)> ejecutado.

source: When a match is successful, the C<$REGMARK> variable will be set to the name of the most recently executed C<(*MARK:NAME)> that was involved in the match.
es: Cuando se detecta una coincidencia, se establece como valor de la variable C<$REGMARK> el nombre del último patrón C<(*MARK:NOMBRE)> ejecutado que participó en la coincidencia.

source: When a program is copied to another machine, the source code does not change, but the STDIO environment might.
es: Cuando se copia un programa a otro equipo, el código fuente no cambia, pero podría cambiar el entorno STDIO.

source: When a string is encoded in UTF-8, Perl assumes that the program is prepared to deal with Unicode, but when the string isn't, Perl assumes that only ASCII (unless it is an EBCDIC platform) is wanted, and so those characters that are not ASCII characters aren't recognized as to what they would be in Unicode.
es: Si una cadena está codificada en UTF-8, Perl supone que el programa está preparado para trabajar con Unicode, pero si la codificación es otra, Perl supone que solo se desea usar ASCII (salvo en plataformas EBCDIC), por lo que los caracteres que no sean ASCII no se reconocerán como lo que serían en Unicode.

source: When another developer uses your class, they don't need to know I<how> it is implemented, they just need to know I<what> it does.
es: Cuando otros desarrolladores usen su clase no necesitarán saber I<cómo> se ha implementado; solo tienen que saber I<qué> es lo que hace.

source: When describing the merge commit, explain the purpose of the branch, and keep in mind that this description will probably be used by the eventual release engineer when reviewing the next perldelta document.
es: Al describir la confirmación de combinación, explique el propósito de la rama y tenga en mente que esta descripción será la que use el ingeniero a cargo de lanzar la siguiente versión cuando revise el documento perldelta correspondiente.

source: When different groups within the same pattern have the same name, any reference to that name assumes the leftmost defined group.
es: Cuando diferentes grupos dentro del mismo patrón tienen el mismo nombre, se supone que cualquier referencia a ese nombre será al grupo definido que esté más a la izquierda.

source: When doing so the following rules apply:
es: Al hacerlo se aplicarán las siguientes reglas:

source: When downloading from CPAN, save your file with a C<.tgz> extension instead of C<.tar.gz>.
es: Al descargar el módulo desde CPAN, guarde el archivo con la extensión C<.tgz> en lugar de C<.tar.gz>.

source: When each filter is called by Perl, a local copy of C<$_> will contain the key or value to be filtered.
es: Cuando Perl llama a uno de estos filtros, una copia local de C<$_> contendrá la clave o el valor que se va a filtrar.

source: When in doubt, before you do anything else, check your status and read it carefully, many questions are answered directly by the git status output.
es: En caso de duda, y antes de hacer cualquier otra cosa, compruebe el estado y léalo atentamente. Encontrará la respuesta a muchas preguntas en la salida del comando C<git status>.

source: When in doubt, parenthesize.
es: En caso de duda, coloque paréntesis.

source: When in doubt, use C<*FH>.
es: En caso de duda, use C<*ARCHIVO>.

source: When inside of a nested pattern, such as recursion, or in a subpattern dynamically generated via C<(??{})>, only the innermost pattern is ended immediately.
es: Si está dentro de un patrón anidado, como en la recursión, o en un subpatrón generado dinámicamente a través de C<(??{})>, solo se termina inmediatamente el patrón más interno.

source: When invoked as F<psed>, it behaves as a F<sed> implementation, written in Perl.
es: Cuando se invoca como F<psed>, se comporta como una implementación de F<sed> escrita en Perl.

source: When it appears singly, it causes the sequences C<\d>, C<\s>, C<\w>, and the Posix character classes to match only in the ASCII range.
es: Cuando aparece solo una vez, hace que las secuencias C<\d>, C<\s>, C<\w> y las clases de caracteres Posix solo detecten en ASCII.

source: When it can't, it emits this warning (if warnings are enabled), and outputs UTF-8 encoded data instead.
es: Si no puede, emite esta advertencia (si las advertencias están habilitadas) y codifica los datos en UTF-8.

source: When it finds the parent class that implements this method, the method is called.
es: Cuando encuentra la clase primaria que implementa este método, llama al método.

source: When it has to give that up because other characters are added to the text string, it silently upgrades the string to UTF-8.
es: Si se agregan otros caracteres a la cadena de texto y Perl tiene que renunciar a esta codificación, "promueve" la cadena a UTF-8 sin avisar.

source: When of the form C<\N{NAME}>, it matches the character or character sequence whose name is C<NAME>; and similarly when of the form C<\N{U+I<hex>}>, it matches the character whose Unicode code point is I<hex>.
es: Cuando es de la forma C<\N{NOMBRE}>, coincide con el carácter o la secuencia de caracteres cuyo nombre es C<NOMBRE>; de manera similar, cuando es de la forma C<\N{U+I<hex>}>, coincide con el carácter cuyo código de carácter Unicode es I<hex>.

source: When perl is configured to use ithreads, it will use re-entrant library calls in preference to non-re-entrant versions.
es: Si Perl está configurado para usar ithreads, las llamadas a biblioteca reentrantes tendrán preferencia sobre las versiones no reentrantes.

source: When something is contained in something else, particularly when that might be considered surprising: "I've embedded a complete Perl interpreter in my editor!"
es: Insertar algo dentro de otra cosa, especialmente cuando se puede considerar sorprendente: "¡He incrustado un intérprete de Perl completo en mi editor!".

source: When the first bad commit is isolated, C<git bisect> will tell you so:
es: Cuando se haya aislado la primera confirmación en la que esté presente el error, C<git bisect> se lo indicará:

source: When the last hard reference goes away, the anonymous referent is destroyed without pity.
es: Cuando desaparece la última referencia estricta, se destruye sin compasión el referente anónimo.

source: When the last reference to an object goes away, the object is destroyed.
es: Cuando se descarta la última referencia a un objeto, se destruye el objeto.

source: When the match runs, the first part of the regular expression (C<\b(foo)>) finds a possible match right at the beginning of the string, and loads up $1 with "Foo".
es: Cuando se ejecuta la detección de coincidencias, la primera parte de la expresión regular (C<\b(come)>) encuentra una posible coincidencia al principio de la cadena y asigna "Come" a $1.

source: When this happens, you can just I<rebase> your work against the new position of blead, like this (assuming your remote for the master repository is "p5p"):
es: Cuando esto ocurre, solo tiene que I<reorganizar> su trabajo con la nueva posición de blead, de esta manera (suponiendo que el repositorio remoto del repositorio principal es "p5p"):

source: When this happens, your push will be rejected with a message like this:
es: En este caso, los cambios enviados se rechazarán con un mensaje como este:

source: When used without a name the "skip point" is where the match point was when executing the (*SKIP) pattern.
es: Cuando se usa sin nombre, el "punto de salto" será la posición en la que estaba el punto de coincidencia al ejecutar el patrón (*SKIP).

source: When used with class methods, the problem is even worse.
es: Cuando se usa con métodos de clase el problema es incluso peor.

source: When using look-ahead assertions and negations, this can all get even trickier.
es: Cuando se utiliza con aserciones de inspección hacia adelante y negaciones, todo esto puede complicarse aún más.

source: When we bless something, we are not blessing the variable which contains a reference to that thing, nor are we blessing the reference that the variable stores; we are blessing the thing that the variable refers to (sometimes known as the I<referent>).
es: La bendición no afecta a la variable que contiene la referencia al objeto bendecido, ni a la referencia almacenada por la variable; lo que se bendice es aquello a lo que hace referencia la variable (lo que algunas veces se denomina I<referente>).

source: When we call C<< $fred->speak() >>, the C<$fred> variable is passed as the first argument to C<speak()>.
es: En la llamada C<< $alfredo->decir() >>, la variable C<$alfredo> se pasa a C<decir()> como primer argumento.

source: When we call C<bless> on a variable, we are actually blessing the underlying data structure that the variable refers to.
es: Cuando se produce la llamada a C<bless> con una variable, se bendice la estructura de datos subyacente a la que la variable hace referencia.
